app/views/models/_form.html.erb

SELECT `manufacturers`.* FROM `manufacturers`
---
    <td><%= f.label :manufacturer %></td>
    <td><%= f.collection_select :manufacturer_id,Manufacturer.all,:id,:name%>

SELECT `storages`.* FROM `storages`
---
   <td> <%= f.label :storage %></td>
   <td> <%= f.collection_select :storage_id,Storage.all,:id,:storage_specfications %>

SELECT `operating_systems`.* FROM `operating_systems`
---
    <%= f.label :operating_system %></td>
   <td> <%= f.collection_select :operating_system_id,OperatingSystem.all,:id,:os_specfications %>

SELECT `processors`.* FROM `processors`
---
    <td><%= f.label :processor %></td>
    <td><%= f.collection_select :processor_id,Processor.all,:id,:processor_specfications %>