app/views/models/show.html.erb

  <strong>manufacturers</strong>
  <%= collection_select(@model,:manufacturer_id,Manufacturer.all,:id,:name)%>
---
SELECT `manufacturers`.* FROM `manufacturers`

  <strong>storage</strong>
  <%= collection_select(@model,:storage_id,Storage.all,:id,:storage_specfications ) %>
---
SELECT `storages`.* FROM `storages`

  <strong>Prcessoe</strong>
  <%= collection_select(@model,:processor_id,Processor.all,:id,:processor_specfications)%>
---
SELECT `processors`.* FROM `processors`

  <strong>operating_system</strong>
  <%= collection_select(@model,:operating_system_id,OperatingSystem.all,:id,:os_specfications)%>
---
SELECT `operating_systems`.* FROM `operating_systems`