app/controllers/cameras_controller.rb

SELECT `cameras`.* FROM `cameras`
---
  def index
    @camera = Camera.all