app/controllers/manufacturers_controller.rb

SELECT `manufacturers`.* FROM `manufacturers`
---
  def index
    @manufacturer = Manufacturer.all

INSERT INTO `manufacturers` (`name`, `year_of_establishment`, `parent_company`, `created_at`, `updated_at`) VALUES ('Google', 2001, 'Alphabet Inc', '2021-01-24 03:14:59', '2021-01-24 03:14:59')
---
  def create
    @manufacturer = Manufacturer.new(manufacturer_params)

    respond_to do |format|
      if @manufacturer.save

SELECT  `manufacturers`.* FROM `manufacturers` WHERE `manufacturers`.`id` = 1 LIMIT 1
---
  def show
    @manufacturer = Manufacturer.find(params[:id])

SELECT  `manufacturers`.* FROM `manufacturers` WHERE `manufacturers`.`id` = 1 LIMIT 1
---
  def set_manufacturer
    @manufacturer = Manufacturer.find(params[:id])