app/controllers/models_controller.rb

  def index
    @model = Model.all
---
SELECT `models`.* FROM `models`

  def create
    save_details(params)

    @model = Model.new(model_params)

    respond_to do |format|
      if @model.save
        @camera = Camera.create({"type"=>params[:model][:camera][:type],"postion"=>params[:model][:camera][:postion],"pixel"=>params[:model][:camera][:pixel],"model_id"=>@model.id}) if params[:model][:camera].present?
---
INSERT INTO `models` (`name`, `description`, `selling_price`, `year_of_release`, `usb_type`, `battery_capacity`, `height`, `width`, `sim_type`, `colour`, `network_supported`, `manufacturer_id`, `storage_id`, `processor_id`, `operating_system_id`, `created_at`, `updated_at`) VALUES ('test123', 'test', 12000, 2018, 'B-type', 4000, 12, 15, 'Dual', 'white', '5G/4G', 6, 2, 2, 2, '2021-01-24 20:02:12', '2021-01-24 20:02:12')
INSERT INTO `cameras` (`type`, `postion`, `pixel`, `model_id`, `created_at`, `updated_at`) VALUES (1, 1, 16, 33, '2021-01-24 20:15:26', '2021-01-24 20:15:26')

  def show
    @model = Model.find(params[:id])
---
SELECT  `models`.* FROM `models` WHERE `models`.`id` = 1 LIMIT 1

  def update
    save_details(params)
    respond_to do |format|
      if params[:model][:camera].present?
        @model.cameras.destroy
        @camera = Camera.create({"type"=>params[:model][:camera][:type],"postion"=>params[:model][:camera][:postion],"pixel"=>params[:model][:camera][:pixel],"model_id"=>@model.id})
      end
      if @model.update(model_params)
---
INSERT INTO `cameras` (`type`, `postion`, `pixel`, `model_id`, `created_at`, `updated_at`) VALUES (1, 1, 12, 31, '2021-01-24 21:01:18', '2021-01-24 21:01:18')
UPDATE `models` SET `usb_type` = '', `sim_type` = '', `colour` = '', `network_supported` = '', `manufacturer_id` = 5, `updated_at` = '2021-01-24 20:50:56' WHERE `models`.`id` = 18

  def destroy
    @model.cameras.destroy
---
DELETE FROM `cameras` WHERE `cameras`.`model_id` = 31
DELETE FROM `models` WHERE `models`.`id` = 30

  def set_model_params

    @model = Model.find(params[:id])
---
SELECT  `models`.* FROM `models` WHERE `models`.`id` = 30 LIMIT 1