app/controllers/operating_systems_controller.rb

SELECT `operating_systems`.* FROM `operating_systems`
---
  def index
    @operating_system = OperatingSystem.all