app/controllers/processors_controller.rb

SELECT `processors`.* FROM `processors`
---
  def index
    @processor = Processor.all